Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1025DAA288.PIC
      <edc:SFRDef edc:_addr="0x1F8EA868" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA26" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA26" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL623" edc:desc="" edc:mask="0xf" edc:name="PIXEL623" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL622" edc:desc="" edc:mask="0xf" edc:name="PIXEL622" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL621" edc:desc="" edc:mask="0xf" edc:name="PIXEL621" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL620" edc:desc="" edc:mask="0xf" edc:name="PIXEL620" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL619" edc:desc="" edc:mask="0xf" edc:name="PIXEL619" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL618" edc:desc="" edc:mask="0xf" edc:name="PIXEL618" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL617" edc:desc="" edc:mask="0xf" edc:name="PIXEL617" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL616" edc:desc="" edc:mask="0xf" edc:name="PIXEL616" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA86C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA27" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA27" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL631" edc:desc="" edc:mask="0xf" edc:name="PIXEL631" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL630" edc:desc="" edc:mask="0xf" edc:name="PIXEL630" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL629" edc:desc="" edc:mask="0xf" edc:name="PIXEL629" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL628" edc:desc="" edc:mask="0xf" edc:name="PIXEL628" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL627" edc:desc="" edc:mask="0xf" edc:name="PIXEL627" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL626" edc:desc="" edc:mask="0xf" edc:name="PIXEL626" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL625" edc:desc="" edc:mask="0xf" edc:name="PIXEL625" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL624" edc:desc="" edc:mask="0xf" edc:name="PIXEL624" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA870" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA28" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL77" edc:desc="" edc:mask="0xf" edc:name="PIXEL77" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL76" edc:desc="" edc:mask="0xf" edc:name="PIXEL76" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL75" edc:desc="" edc:mask="0xf" edc:name="PIXEL75" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL74" edc:desc="" edc:mask="0xf" edc:name="PIXEL74" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL73" edc:desc="" edc:mask="0xf" edc:name="PIXEL73" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL72" edc:desc="" edc:mask="0xf" edc:name="PIXEL72" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL71" edc:desc="" edc:mask="0xf" edc:name="PIXEL71" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL70" edc:desc="" edc:mask="0xf" edc:name="PIXEL70" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA874" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA29" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL715" edc:desc="" edc:mask="0xf" edc:name="PIXEL715" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL714" edc:desc="" edc:mask="0xf" edc:name="PIXEL714" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL713" edc:desc="" edc:mask="0xf" edc:name="PIXEL713" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL712" edc:desc="" edc:mask="0xf" edc:name="PIXEL712" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL711" edc:desc="" edc:mask="0xf" edc:name="PIXEL711" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL710" edc:desc="" edc:mask="0xf" edc:name="PIXEL710" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL79" edc:desc="" edc:mask="0xf" edc:name="PIXEL89" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL78" edc:desc="" edc:mask="0xf" edc:name="PIXEL78" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA878" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA30" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL723" edc:desc="" edc:mask="0xf" edc:name="PIXEL723" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL722" edc:desc="" edc:mask="0xf" edc:name="PIXEL722" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL721" edc:desc="" edc:mask="0xf" edc:name="PIXEL721" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL720" edc:desc="" edc:mask="0xf" edc:name="PIXEL720" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL719" edc:desc="" edc:mask="0xf" edc:name="PIXEL719" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL718" edc:desc="" edc:mask="0xf" edc:name="PIXEL718" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL717" edc:desc="" edc:mask="0xf" edc:name="PIXEL717" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL716" edc:desc="" edc:mask="0xf" edc:name="PIXEL716" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA87C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA31" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL731" edc:desc="" edc:mask="0xf" edc:name="PIXEL731" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL730" edc:desc="" edc:mask="0xf" edc:name="PIXEL730" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL729" edc:desc="" edc:mask="0xf" edc:name="PIXEL729" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL728" edc:desc="" edc:mask="0xf" edc:name="PIXEL728" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL727" edc:desc="" edc:mask="0xf" edc:name="PIXEL727" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL726" edc:desc="" edc:mask="0xf" edc:name="PIXEL726" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL725" edc:desc="" edc:mask="0xf" edc:name="PIXEL725" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL724" edc:desc="" edc:mask="0xf" edc:name="PIXEL724" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA880" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA32" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL87" edc:desc="" edc:mask="0xf" edc:name="PIXEL87" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL86" edc:desc="" edc:mask="0xf" edc:name="PIXEL86" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL85" edc:desc="" edc:mask="0xf" edc:name="PIXEL85" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL84" edc:desc="" edc:mask="0xf" edc:name="PIXEL84" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL83" edc:desc="" edc:mask="0xf" edc:name="PIXEL83" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL82" edc:desc="" edc:mask="0xf" edc:name="PIXEL82" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL81" edc:desc="" edc:mask="0xf" edc:name="PIXEL81" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL80" edc:desc="" edc:mask="0xf" edc:name="PIXEL80" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA884" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA33" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA33" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL815" edc:desc="" edc:mask="0xf" edc:name="PIXEL815" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL814" edc:desc="" edc:mask="0xf" edc:name="PIXEL814" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL813" edc:desc="" edc:mask="0xf" edc:name="PIXEL813" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL812" edc:desc="" edc:mask="0xf" edc:name="PIXEL812" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL811" edc:desc="" edc:mask="0xf" edc:name="PIXEL811" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL810" edc:desc="" edc:mask="0xf" edc:name="PIXEL810" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL89" edc:desc="" edc:mask="0xf" edc:name="PIXEL9" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL88" edc:desc="" edc:mask="0xf" edc:name="PIXEL78" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA888" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA34" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA34" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL823" edc:desc="" edc:mask="0xf" edc:name="PIXEL823" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL822" edc:desc="" edc:mask="0xf" edc:name="PIXEL822" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL821" edc:desc="" edc:mask="0xf" edc:name="PIXEL821" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL820" edc:desc="" edc:mask="0xf" edc:name="PIXEL820" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL819" edc:desc="" edc:mask="0xf" edc:name="PIXEL819" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL818" edc:desc="" edc:mask="0xf" edc:name="PIXEL818" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL817" edc:desc="" edc:mask="0xf" edc:name="PIXEL817" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL816" edc:desc="" edc:mask="0xf" edc:name="PIXEL816" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA88C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA35" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA35" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL831" edc:desc="" edc:mask="0xf" edc:name="PIXEL831" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL830" edc:desc="" edc:mask="0xf" edc:name="PIXEL830" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL829" edc:desc="" edc:mask="0xf" edc:name="PIXEL829" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL828" edc:desc="" edc:mask="0xf" edc:name="PIXEL828" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL827" edc:desc="" edc:mask="0xf" edc:name="PIXEL827" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL826" edc:desc="" edc:mask="0xf" edc:name="PIXEL826" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL825" edc:desc="" edc:mask="0xf" edc:name="PIXEL825" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL824" edc:desc="" edc:mask="0xf" edc:name="PIXEL824" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
