Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1025DAA288.PIC
      <edc:SFRDef edc:_addr="0x1F8EA978" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA94" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA94" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2323" edc:desc="" edc:mask="0xf" edc:name="PIXEL2323" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2322" edc:desc="" edc:mask="0xf" edc:name="PIXEL2322" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2321" edc:desc="" edc:mask="0xf" edc:name="PIXEL2321" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2320" edc:desc="" edc:mask="0xf" edc:name="PIXEL2320" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2319" edc:desc="" edc:mask="0xf" edc:name="PIXEL2319" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2318" edc:desc="" edc:mask="0xf" edc:name="PIXEL2318" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2317" edc:desc="" edc:mask="0xf" edc:name="PIXEL2317" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2316" edc:desc="" edc:mask="0xf" edc:name="PIXEL2316" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA97C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA95" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA95" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2331" edc:desc="" edc:mask="0xf" edc:name="PIXEL2331" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2330" edc:desc="" edc:mask="0xf" edc:name="PIXEL2330" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2329" edc:desc="" edc:mask="0xf" edc:name="PIXEL2329" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2328" edc:desc="" edc:mask="0xf" edc:name="PIXEL2328" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2327" edc:desc="" edc:mask="0xf" edc:name="PIXEL2327" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2326" edc:desc="" edc:mask="0xf" edc:name="PIXEL2326" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2325" edc:desc="" edc:mask="0xf" edc:name="PIXEL2325" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2324" edc:desc="" edc:mask="0xf" edc:name="PIXEL2324" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA980" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA96" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA96" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL247" edc:desc="" edc:mask="0xf" edc:name="PIXEL247" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL246" edc:desc="" edc:mask="0xf" edc:name="PIXEL246" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL245" edc:desc="" edc:mask="0xf" edc:name="PIXEL245" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL244" edc:desc="" edc:mask="0xf" edc:name="PIXEL244" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL243" edc:desc="" edc:mask="0xf" edc:name="PIXEL243" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL242" edc:desc="" edc:mask="0xf" edc:name="PIXEL242" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL241" edc:desc="" edc:mask="0xf" edc:name="PIXEL241" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL240" edc:desc="" edc:mask="0xf" edc:name="PIXEL240" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA984" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA97" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA97" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2415" edc:desc="" edc:mask="0xf" edc:name="PIXEL2415" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2414" edc:desc="" edc:mask="0xf" edc:name="PIXEL2414" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2413" edc:desc="" edc:mask="0xf" edc:name="PIXEL2413" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2412" edc:desc="" edc:mask="0xf" edc:name="PIXEL2412" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2411" edc:desc="" edc:mask="0xf" edc:name="PIXEL2411" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2410" edc:desc="" edc:mask="0xf" edc:name="PIXEL2410" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL249" edc:desc="" edc:mask="0xf" edc:name="PIXEL249" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL248" edc:desc="" edc:mask="0xf" edc:name="PIXEL248" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
